Nerdiyde/ESP32_Neomatrix_GIF_display/ESP32_Neomatrix_GIF_display/neomatrix_config.h
#ifdef LEDMATRIX
// Please use https://github.com/marcmerlin/LEDMatrix/ at least as recent as
// https://github.com/marcmerlin/LEDMatrix/commit/597ce703e924d45b2e676d6558c4c74a8ebc6991
// or https://github.com/Jorgen-VikingGod/LEDMatrix/commit/a11e74c8cd5b933021b6e15eb067280a52691449
// zero copy/no malloc code to work.
#include <LEDMatrix.h>
#endif


//============================================================================
// Ok, if you're doing matrices of displays, there is also a reasonable chance
// you'll be using SPIFFS or FATFS on flash, or an sdcard, so let's define it
// here (NeoMatrix-FastLED-IR actually also uses this to read a config file)
//============================================================================

// Note, you can use an sdcard on ESP32 or ESP8266 if you really want,
// but if your data fits in built in flash, why not use it?
// Use built in flash via SPIFFS/FATFS
// esp8266com/esp8266/libraries/SD/src/File.cpp
// ESP8266: http://esp8266.github.io/Arduino/versions/2.3.0/doc/filesystem.html#uploading-files-to-file-system
// ESP32: https://github.com/me-no-dev/arduino-esp32fs-plugin
// https://github.com/marcmerlin/esp32_fatfsimage/blob/master/README.md
#if defined(ESP8266)
#define FS_PREFIX ""
#include <FS.h>
#define FSO SPIFFS
#define FSOSPIFFS
#if gif_size == 64
#define GIF_DIRECTORY FS_PREFIX "/gifs64/"
#else
#define GIF_DIRECTORY FS_PREFIX "/gifs/"
#endif
extern "C" {
#include "user_interface.h"
}
#elif defined(ESP32)
#define FS_PREFIX ""
#if ESP32FATFS
#include "FFat.h"
#define FSO FFat
#define FSOFAT
#else
// LittleFS is more memory efficient than FatFS
#include "FS.h"
#include <LITTLEFS.h>
#define FSO LITTLEFS
#define FSOLITTLEFS
#endif
#if gif_size == 64
#define GIF_DIRECTORY FS_PREFIX "/gifs64"
#elif gif_size == 32
#define GIF_DIRECTORY FS_PREFIX "/gifs"
#else
#define GIF_DIRECTORY FS_PREFIX "/"
#endif
#elif defined(ARDUINOONPC)
#define UNIXFS
#define FS_PREFIX "/root/NM/"
#define GIF_DIRECTORY FS_PREFIX "gifs/"
#else
#define FS_PREFIX ""
#define FSO SD
#define FSOSD
#if defined (ARDUINO)
#include <SD.h>
#endif
// Chip select for SD card on the SmartMatrix Shield or Photon
// Teensy 3.5/3.6
#if defined(__MK64FX512__) || defined(__MK66FX1M0__)
#define SD_CS BUILTIN_SDCARD
#elif defined(ESP32)
#define SD_CS 5
#elif defined (ARDUINO)
#define SD_CS 15
//#define SD_CS BUILTIN_SDCARD
#elif defined (SPARK)
#define SD_CS SS
#endif

// Teensy SD Library requires a trailing slash in the directory name
#if gif_size == 64
#define GIF_DIRECTORY FS_PREFIX "/gifs64/"
#else
#define GIF_DIRECTORY FS_PREFIX "/gifs/"
#endif
#endif

//============================================================================
// Matrix defines (SMARTMATRIX vs NEOMATRIX and size)
// You should #define one and only one of them and if you need to edit it,
// edit both the block below and the 2nd block in setup() at the bottom of this file
//============================================================================
//

#if defined(MATRIX_SIZE_16X16)

#include <FastLED_NeoMatrix.h>
#define FASTLED_NEOMATRIX

const uint8_t MATRIXPIN = MATRIX_PIN;

uint8_t matrix_brightness = MATRIX_BRIGHTNESS;
// Used by LEDMatrix
const uint16_t MATRIX_TILE_WIDTH = 16; // width of EACH NEOPIXEL MATRIX (not total display)
const uint16_t MATRIX_TILE_HEIGHT = 16; // height of each matrix
const uint8_t MATRIX_TILE_H     = 1;  // number of matrices arranged horizontally
const uint8_t MATRIX_TILE_V     = 1;  // number of matrices arranged vertically

CRGB *matrixleds;
#ifdef LEDMATRIX
// cLEDMatrix defines
// Unfortunately LEDMatrix has its own matrix definition that isn't as well documented
// and easy to use. Look for examples if you need to setup a matrix of matrices.
cLEDMatrix<MATRIX_TILE_WIDTH, MATRIX_TILE_HEIGHT, HORIZONTAL_MATRIX,
           MATRIX_TILE_H, MATRIX_TILE_V, HORIZONTAL_BLOCKS> ledmatrix(false);
#endif

// MATRIX DECLARATION:
// Parameter 1 = width of EACH NEOPIXEL MATRIX (not total display)
// Parameter 2 = height of each matrix
// Parameter 3 = number of matrices arranged horizontally
// Parameter 4 = number of matrices arranged vertically
// Parameter 5 = pin number (most are valid)
// Parameter 6 = matrix layout flags, add together as needed:
//   NEO_MATRIX_TOP, NEO_MATRIX_BOTTOM, NEO_MATRIX_LEFT, NEO_MATRIX_RIGHT:
//     Position of the FIRST LED in the FIRST MATRIX; pick two, e.g.
//     NEO_MATRIX_TOP + NEO_MATRIX_LEFT for the top-left corner.
//   NEO_MATRIX_ROWS, NEO_MATRIX_COLUMNS: LEDs WITHIN EACH MATRIX are
//     arranged in horizontal rows or in vertical columns, respectively;
//     pick one or the other.
//   NEO_MATRIX_PROGRESSIVE, NEO_MATRIX_ZIGZAG: all rows/columns WITHIN
//     EACH MATRIX proceed in the same order, or alternate lines reverse
//     direction; pick one.
//   NEO_TILE_TOP, NEO_TILE_BOTTOM, NEO_TILE_LEFT, NEO_TILE_RIGHT:
//     Position of the FIRST MATRIX (tile) in the OVERALL DISPLAY; pick
//     two, e.g. NEO_TILE_TOP + NEO_TILE_LEFT for the top-left corner.
//   NEO_TILE_ROWS, NEO_TILE_COLUMNS: the matrices in the OVERALL DISPLAY
//     are arranged in horizontal rows or in vertical columns, respectively;
//     pick one or the other.
//   NEO_TILE_PROGRESSIVE, NEO_TILE_ZIGZAG: the ROWS/COLUMS OF MATRICES
//     (tiles) in the OVERALL DISPLAY proceed in the same order for every
//     line, or alternate lines reverse direction; pick one.  When using
//     zig-zag order, the orientation of the matrices in alternate rows
//     will be rotated 180 degrees (this is normal -- simplifies wiring).
//   See example below for these values in action.
FastLED_NeoMatrix *matrix = new FastLED_NeoMatrix(matrixleds, MATRIX_TILE_WIDTH, MATRIX_TILE_HEIGHT,
    NEO_MATRIX_BOTTOM + NEO_MATRIX_LEFT +
    NEO_TILE_ROWS + NEO_TILE_PROGRESSIVE );

#elif defined(MATRIX_SIZE_24X24)
#include <FastLED_NeoMatrix.h>
#define FASTLED_NEOMATRIX

const uint8_t MATRIXPIN = MATRIX_PIN;

uint8_t matrix_brightness = MATRIX_BRIGHTNESS;
// Used by LEDMatrix
const uint16_t MATRIX_TILE_WIDTH = 24; // width of EACH NEOPIXEL MATRIX (not total display)
const uint16_t MATRIX_TILE_HEIGHT = 24; // height of each matrix
const uint8_t MATRIX_TILE_H     = 1;  // number of matrices arranged horizontally
const uint8_t MATRIX_TILE_V     = 1;  // number of matrices arranged vertically

CRGB *matrixleds;
#ifdef LEDMATRIX
// cLEDMatrix defines
// Unfortunately LEDMatrix has its own matrix definition that isn't as well documented
// and easy to use. Look for examples if you need to setup a matrix of matrices.
cLEDMatrix<MATRIX_TILE_WIDTH, MATRIX_TILE_HEIGHT, HORIZONTAL_MATRIX,
           MATRIX_TILE_H, MATRIX_TILE_V, HORIZONTAL_BLOCKS> ledmatrix(false);
#endif

// MATRIX DECLARATION:
// Parameter 1 = width of EACH NEOPIXEL MATRIX (not total display)
// Parameter 2 = height of each matrix
// Parameter 3 = number of matrices arranged horizontally
// Parameter 4 = number of matrices arranged vertically
// Parameter 5 = pin number (most are valid)
// Parameter 6 = matrix layout flags, add together as needed:
//   NEO_MATRIX_TOP, NEO_MATRIX_BOTTOM, NEO_MATRIX_LEFT, NEO_MATRIX_RIGHT:
//     Position of the FIRST LED in the FIRST MATRIX; pick two, e.g.
//     NEO_MATRIX_TOP + NEO_MATRIX_LEFT for the top-left corner.
//   NEO_MATRIX_ROWS, NEO_MATRIX_COLUMNS: LEDs WITHIN EACH MATRIX are
//     arranged in horizontal rows or in vertical columns, respectively;
//     pick one or the other.
//   NEO_MATRIX_PROGRESSIVE, NEO_MATRIX_ZIGZAG: all rows/columns WITHIN
//     EACH MATRIX proceed in the same order, or alternate lines reverse
//     direction; pick one.
//   NEO_TILE_TOP, NEO_TILE_BOTTOM, NEO_TILE_LEFT, NEO_TILE_RIGHT:
//     Position of the FIRST MATRIX (tile) in the OVERALL DISPLAY; pick
//     two, e.g. NEO_TILE_TOP + NEO_TILE_LEFT for the top-left corner.
//   NEO_TILE_ROWS, NEO_TILE_COLUMNS: the matrices in the OVERALL DISPLAY
//     are arranged in horizontal rows or in vertical columns, respectively;
//     pick one or the other.
//   NEO_TILE_PROGRESSIVE, NEO_TILE_ZIGZAG: the ROWS/COLUMS OF MATRICES
//     (tiles) in the OVERALL DISPLAY proceed in the same order for every
//     line, or alternate lines reverse direction; pick one.  When using
//     zig-zag order, the orientation of the matrices in alternate rows
//     will be rotated 180 degrees (this is normal -- simplifies wiring).
//   See example below for these values in action.
FastLED_NeoMatrix *matrix = new FastLED_NeoMatrix(matrixleds, MATRIX_TILE_WIDTH, MATRIX_TILE_HEIGHT,
    NEO_MATRIX_BOTTOM + NEO_MATRIX_LEFT +
    NEO_TILE_ROWS + NEO_TILE_PROGRESSIVE );

//----------------------------------------------------------------------------
#elif defined(M32BY8X3)
#include <FastLED_NeoMatrix.h>
#define FASTLED_NEOMATRIX

uint8_t matrix_brightness = 64;
// Used by LEDMatrix
const uint16_t MATRIX_TILE_WIDTH = 8; // width of EACH NEOPIXEL MATRIX (not total display)
const uint16_t MATRIX_TILE_HEIGHT = 32; // height of each matrix
const uint8_t MATRIX_TILE_H     = 3;  // number of matrices arranged horizontally
const uint8_t MATRIX_TILE_V     = 1;  // number of matrices arranged vertically

