Nerdiyde/ESP32_Neomatrix_GIF_display/ESP32_Neomatrix_GIF_display/neomatrix_config.h
// Used by some demos
const uint32_t NUMMATRIX = mw * mh;
const uint32_t NUM_LEDS = NUMMATRIX;

// Compat with SmartMatrix code that uses those variables
// (but don't redefine for SmartMatrix backend)
#ifndef SMARTMATRIX
const uint16_t kMatrixWidth = mw;
const uint16_t kMatrixHeight = mh;
#endif
#pragma GCC diagnostic pop

#ifdef ESP8266
// Turn off Wifi in setup()
// https://www.hackster.io/rayburne/esp8266-turn-off-wifi-reduce-current-big-time-1df8ae
//
#include "ESP8266WiFi.h"
extern "C" {
#include "user_interface.h"
}
#endif // ESP8266

uint8_t gHue = 0; // rotating "base color" used by many of the patterns
uint16_t speed = 255;

float matrix_gamma = 1; // higher number is darker, needed for Neomatrix more than SmartMatrix

// Like XY, but for a mirror image from the top (used by misconfigured code)
int XY2( int x, int y, bool wrap = false) {
  wrap = wrap; // squelch compiler warning
  return matrix->XY(x, MATRIX_HEIGHT - 1 - y);
}

// FastLED::colorutils needs a signature with uint8_t
uint16_t XY( uint8_t x, uint8_t y) {
  return matrix->XY(x, y);
}
// but x/y can be bigger than 256
uint16_t XY16( uint16_t x, uint16_t y) {
  return matrix->XY(x, y);
}

int wrapX(int x) {
  if (x < 0 ) return 0;
  if (x >= MATRIX_WIDTH) return (MATRIX_WIDTH - 1);
  return x;
}

void show_free_mem(const char *pre = NULL) {
  Framebuffer_GFX::show_free_mem(pre);
}

void die(const char *mesg) {
  Serial.println(mesg);
  while (1) delay((uint32_t)1); // while 1 loop only triggers watchdog on ESP chips
}

void *mallocordie(const char *varname, uint32_t req, bool psram = true) {
  // If varname starts with @, show debug for the allocation
  void *mem;

#ifndef BOARD_HAS_PSRAM
  psram = false;
#endif
  if (varname[0] == '@') {
    if (psram) Serial.print("PS");
    Serial.print("Malloc ");
    Serial.print(varname);
    Serial.print(" . Requested bytes: ");
    Serial.println(req);
  }
#ifdef ESP32
  if (psram) {
    mem = ps_malloc(req);
  } else {
    mem = malloc(req);
  }
#else
  mem = malloc(req);
#endif

  if (mem) {
    return mem;
  } else {
    show_free_mem();
    Serial.println("vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv");
    Serial.print("FATAL: ");
    if (psram) Serial.print("ps_");
    Serial.print("malloc failed for ");
    Serial.print(varname);
    Serial.print(" . Requested bytes: ");
    Serial.println(req);
    Serial.println("^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^");
    while (1); // delay(1);  Adding this seems to cause an ESP32 bug
  }
  return NULL;
}

uint32_t millisdiff(uint32_t before) {
  return ((millis() - before) ? (millis() - before) : 1);
}

void matrix_setup(bool initserial = true, int reservemem = 40000) {
  reservemem = reservemem; // squelch compiler warning if var is unused.

  if (init_done)
  {
    Serial.println(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> BUG: matrix_setup called twice");
    return;
  }
  init_done = 1;

  // It's bad to call Serial.begin twice, if your calling script runs it first, make sure
  // you request that it isn't called a 2nd time here.
  if (initserial)
  {
    Serial.begin(115200);
    Serial.println(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> Serial.begin");
  }

  // Teensy takes a while to initialize serial port.
  // Teensy 3.0, 3.1/3.2, 3.5, 3.6, 4.0+4.1
  // https://docs.platformio.org/en/latest/platforms/teensy.html
#if defined(__MK20DX128__) || defined(__MK20DX256__) || defined(__MK64FX512__) || defined(__MK66FX1M0__) || defined(__IMXRT1062__)
  delay(3000);
#endif
  show_free_mem("Memory after setup() starts");

  // Smartmatrix defines the framebuffers itself. Other methods make their own allocation here
#if !defined(SMARTMATRIX)
  // ESP32 has more memory available for allocation in setup than in global
  // (if this were a global array), so we use malloc here.
  // https://forum.arduino.cc/index.php?topic=647833
  matrixleds = (CRGB *) mallocordie("matrixleds", sizeof(CRGB) * NUMMATRIX, 1);
  // and then fix the until now NULL pointer in the object.
  matrix->newLedsPtr(matrixleds);
  show_free_mem("After matrixleds malloc");
#ifdef LEDMATRIX
  Serial.println("ledmatrix.SetLEDArray");
  ledmatrix.SetLEDArray(matrixleds);
#endif
#endif


  //============================================================================================
  // Matrix Init Start
  //============================================================================================
#if defined(MATRIX_SIZE_16X16)

  FastLED.addLeds<NEOPIXEL, MATRIXPIN>(matrixleds, NUMMATRIX).setCorrection(TypicalLEDStrip);
  Serial.print("Neomatrix total LEDs: ");
  Serial.print(NUMMATRIX);
  Serial.print(" running on pin: ");
  Serial.println(MATRIXPIN);

#elif defined(MATRIX_SIZE_24X24)
  FastLED.addLeds<NEOPIXEL, MATRIXPIN>(matrixleds, NUMMATRIX).setCorrection(TypicalLEDStrip);
  Serial.print("Neomatrix total LEDs: ");
  Serial.print(NUMMATRIX);
  Serial.print(" running on pin: ");
  Serial.println(MATRIXPIN);

  //============================================================================================
  // Example of parallel output
#elif defined(M32BY8X3)
  // Init Matrix
  // Serialized, 768 pixels takes 26 seconds for 1000 updates or 26ms per refresh
  // FastLED.addLeds<NEOPIXEL,MATRIXPIN>(matrixleds, NUMMATRIX).setCorrection(TypicalLEDStrip);
  // https://github.com/FastLED/FastLED/wiki/Parallel-Output
  // WS2811_PORTA - pins 12, 13, 14 and 15 or pins 6,7,5 and 8 on the NodeMCU
  // This is much faster 1000 updates in 10sec
  // See  https://github.com/FastLED/FastLED/wiki/Parallel-Output for pin definitions
#ifdef ESP8266
  FastLED.addLeds<WS2811_PORTA, 3>(matrixleds, NUMMATRIX / MATRIX_TILE_H).setCorrection(TypicalLEDStrip);
#else
  FastLED.addLeds<WS2811_PORTD, 3>(matrixleds, NUMMATRIX / MATRIX_TILE_H).setCorrection(TypicalLEDStrip);
#endif
  Serial.print("Neomatrix parallel output, total LEDs: ");
  Serial.println(NUMMATRIX);

  //============================================================================================
  // Serialized (slow-ish) output
#elif defined(MATRIX_SIZE_16X16_4_TILES)
  FastLED.addLeds<NEOPIXEL, MATRIXPIN>(matrixleds, NUMMATRIX).setCorrection(TypicalLEDStrip);
  Serial.print("Neomatrix total LEDs: ");
  Serial.print(NUMMATRIX);
  Serial.print(" running on pin: ");
  Serial.println(MATRIXPIN);

