Nerdiyde/ESP32_Neomatrix_GIF_display/ESP32_Neomatrix_GIF_display/neomatrix_config.h
  //============================================================================================
#elif defined(MATRIX_SIZE_64X64) // 64x64 straight connection (no matrices)
  // https://github.com/FastLED/FastLED/wiki/Multiple-Controller-Examples
  FastLED.addLeds<WS2812B, 23, GRB>(matrixleds, 0 * NUM_LEDS_PER_STRIP, NUM_LEDS_PER_STRIP);
#ifdef ESP32
  FastLED.addLeds<WS2812B, 22, GRB>(matrixleds, 1 * NUM_LEDS_PER_STRIP, NUM_LEDS_PER_STRIP);
  FastLED.addLeds<WS2812B, 27, GRB>(matrixleds, 2 * NUM_LEDS_PER_STRIP, NUM_LEDS_PER_STRIP); // was 3
  FastLED.addLeds<WS2812B, 21, GRB>(matrixleds, 3 * NUM_LEDS_PER_STRIP, NUM_LEDS_PER_STRIP);
  FastLED.addLeds<WS2812B, 19, GRB>(matrixleds, 4 * NUM_LEDS_PER_STRIP, NUM_LEDS_PER_STRIP);
  FastLED.addLeds<WS2812B, 18, GRB>(matrixleds, 5 * NUM_LEDS_PER_STRIP, NUM_LEDS_PER_STRIP);
  FastLED.addLeds<WS2812B, 5, GRB>(matrixleds, 6 * NUM_LEDS_PER_STRIP, NUM_LEDS_PER_STRIP);
  FastLED.addLeds<WS2812B, 4, GRB>(matrixleds, 7 * NUM_LEDS_PER_STRIP, NUM_LEDS_PER_STRIP);

  FastLED.addLeds<WS2812B, 0, GRB>(matrixleds, 8 * NUM_LEDS_PER_STRIP, NUM_LEDS_PER_STRIP);
  FastLED.addLeds<WS2812B, 2, GRB>(matrixleds, 9 * NUM_LEDS_PER_STRIP, NUM_LEDS_PER_STRIP);
  FastLED.addLeds<WS2812B, 15, GRB>(matrixleds, 10 * NUM_LEDS_PER_STRIP, NUM_LEDS_PER_STRIP);
  FastLED.addLeds<WS2812B, 25, GRB>(matrixleds, 11 * NUM_LEDS_PER_STRIP, NUM_LEDS_PER_STRIP);
  FastLED.addLeds<WS2812B, 26, GRB>(matrixleds, 12 * NUM_LEDS_PER_STRIP, NUM_LEDS_PER_STRIP);
  FastLED.addLeds<WS2812B, 14, GRB>(matrixleds, 13 * NUM_LEDS_PER_STRIP, NUM_LEDS_PER_STRIP);
  FastLED.addLeds<WS2812B, 12, GRB>(matrixleds, 14 * NUM_LEDS_PER_STRIP, NUM_LEDS_PER_STRIP);
  FastLED.addLeds<WS2812B, 13, GRB>(matrixleds, 15 * NUM_LEDS_PER_STRIP, NUM_LEDS_PER_STRIP);

  Serial.print("Neomatrix 16 pin via RMT/I2S 16 way parallel output, total LEDs: ");
  Serial.println(NUMMATRIX);
#endif // ESP32
  matrix_gamma = 2.4; // higher number is darker, needed for Neomatrix more than SmartMatrix

  //============================================================================================
#elif defined(SMARTMATRIX)
  matrix_gamma = 1; // SmartMatrix should be good by default.
  matrixLayer.addLayer(&backgroundLayer);
  // SmartMatrix takes all the RAM it can get its hands on. Get it to leave some
  // free RAM so that other libraries can work too.
#ifdef ESP32
  if (reservemem) matrixLayer.begin(reservemem); else matrixLayer.begin();
#else
  matrixLayer.begin();
#endif
  // This sets the neomatrix and LEDMatrix pointers
  show_callback();
  matrixLayer.setRefreshRate(240);
  backgroundLayer.enableColorCorrection(true);
  Serial.print(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> SmartMatrix GFX output, total LEDs: ");
  Serial.println(NUMMATRIX);
  // Quick hello world test
#ifndef DISABLE_MATRIX_TEST
  Serial.println(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> SmartMatrix Grey Demo");
  backgroundLayer.fillScreen( {0x80, 0x80, 0x80} );
  // backgroundLayer.swapBuffers();
  show_callback();
  delay(1000);
#endif
  Serial.println(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> SmartMatrix Init Done");

  //============================================================================================
#elif defined(LINUX_RENDERER_X11)
  // Need to init the underlying TFT SPI engine
  Serial.println("ARDUINOONPC LINUX_RENDERER_X11 tft begin");
  tft->begin();
  matrix->fillScreen(LTDC_BLACK);

  //============================================================================================
#elif defined(LINUX_RENDERER_SDL)
  FastLED.addLeds<SDL, mw, mh>(matrixleds, NUMMATRIX);
  Serial.print("Neomatrix on top of SDL. Please use '+' on numeric keypad for brighter, total LEDs: ");
  Serial.println(NUMMATRIX);

  //============================================================================================
#elif defined(RPIRGBPANEL)
  Serial.println("Using rpi-rgb-led-matrix");

  rgb_matrix::RGBMatrix::Options defaults;
  defaults.hardware_mapping = "regular"; // or e.g. "adafruit-hat"
#ifdef GFXDISPLAY_M384BY256
  defaults.rows = 64;
  defaults.cols = 128;
  defaults.chain_length = 4;
  defaults.parallel = 3;
  defaults.pwm_lsb_nanoseconds = 100;
  defaults.pwm_bits = 7;
  // Time dithering of lower bits
  // 2 changes speed from 400Hz (from 160Hz)
  defaults.pwm_dither_bits = 2;
  defaults.led_rgb_sequence = "RBG";
  defaults.panel_type = "FM6126A";
  defaults.pixel_mapper_config = "V-mapper";
#elif GFXDISPLAY_M192BY160
  defaults.rows = 32;
  defaults.cols = 64;
  defaults.chain_length = 5;
  defaults.parallel = 3;
  defaults.pwm_lsb_nanoseconds = 100;
  defaults.pwm_bits = 7;
  // Time dithering of lower bits
  // 2 changes speed from 400Hz (from 160Hz)
  defaults.pwm_dither_bits = 2;
  //defaults.led_rgb_sequence = "RBG";
  defaults.panel_type = "FM6126A";
  defaults.pixel_mapper_config = "V-mapper:Z";
#elif GFXDISPLAY_M128BY192
  defaults.rows = 64;
  defaults.cols = 128;
  defaults.chain_length = 1;
  defaults.parallel = 3;
  // 100->50: 180Hz to 333Hz refresh
  defaults.pwm_lsb_nanoseconds = 70;
  defaults.pwm_bits = 7;
  // Time dithering of lower bits
  // 2 changes speed from 400Hz (from 160Hz)
  // or 520Hz with lsb_ns at 50 not 100
  // but things are 1/3rd as bright so
  // we go back to 0 for 333Hz with 50ns
  defaults.pwm_dither_bits = 1;
  defaults.led_rgb_sequence = "RBG";
  defaults.panel_type = "FM6126A";
#else
  defaults.rows = 64;
  defaults.cols = 128;
  defaults.chain_length = 1;
  defaults.parallel = 3;
  defaults.pwm_lsb_nanoseconds = 100;
  defaults.pwm_bits = 7;
  defaults.pwm_dither_bits = 2;
  defaults.led_rgb_sequence = "RBG";
  defaults.panel_type = "FM6126A";
#endif

  rgb_matrix::RuntimeOptions ropt;
#ifdef RPI4
  ropt.gpio_slowdown = 2;
#else
  ropt.gpio_slowdown = 1;
#endif
  // stay root (useful for accessing /dev/ttyUSB0 and others)
  ropt.drop_privileges = -1;

  RGBMatrix *rgbmatrix = rgb_matrix::CreateMatrixFromOptions(defaults, ropt);
  while (rgbmatrix == NULL) Serial.println("RGBMatrix did not initialize");
  matrix->setMatrix(rgbmatrix);
  Serial.println("RGBPanel RGBMatrix initialized");

