Nerdiyde/ESP32_Neomatrix_GIF_display/ESP32_Neomatrix_GIF_display/neomatrix_config.h
  //============================================================================================
#elif defined(M5STACK)
  // Need to init the underlying TFT SPI engine
  Serial.println("M5STACK begin");
  M5.begin();
  M5.Power.begin();
  M5.Lcd.fillScreen(BLUE);

  //============================================================================================
#elif defined(ILI9341)
  // On my test bench, my ILI9341 doesn't like more than 24Mhz, although when wired properly
  // it should run at 80Mhz
  tft_spi_speed = 60 * 1000 * 1000;
  Serial.println("");
  Serial.println("ILI9341 tft begin");
  // Need to init the underlying TFT SPI engine
  tft->begin(tft_spi_speed);
#ifdef ADAFRUIT_TFT
  // Seems that filllscreen initializes the tft so that it works (setAddrWindow)
  tft->fillScreen(ILI9341_DARKGREY);
#endif

  //============================================================================================
#elif defined(ST7735_128b160)
  tft_spi_speed = 40 * 1000 * 1000;
  Serial.println("");
  Serial.println("ST7735_128b160 tft begin");
  Serial.println(">>> If you get no display, try resetting, and removing cross talk between wires or decreasing SPI speed <<<<");
  Serial.println("");
#ifdef ADAFRUIT_TFT
  // initR calls begin for us but does not allow setting SPI speed (hardcoded in the file)
  tft->initR(INITR_BLACKTAB);
  tft->setSPISpeed(tft_spi_speed);
  // fillScreen below does the job
  //tft->setAddrWindow(0, 0, 128, 160);
  // This is required for the screen to work
  tft->fillScreen(ST77XX_GREEN);
#else
  tft->begin(tft_spi_speed);
#endif

  //============================================================================================
#elif defined(ST7735_128b128)
  tft_spi_speed = 40 * 1000 * 1000;
  Serial.println("");
  Serial.println("ST7735_128b128 tft begin");
  Serial.println(">>> If you get no display, try resetting, and removing cross talk between wires or decreasing SPI speed <<<<");
  Serial.println("");
#ifdef ADAFRUIT_TFT
  // initR calls begin for us but does not allow setting SPI speed (hardcoded in the file)
  tft->initR(INITR_144GREENTAB);
  tft->setSPISpeed(tft_spi_speed);
  // This is required for the screen to work
  tft->fillScreen(ST77XX_GREEN);
#else
  tft->begin(tft_spi_speed);
#endif

  //============================================================================================
#elif defined(SSD1331)
  // Need to init the underlying TFT SPI engine
  tft_spi_speed = 40 * 1000 * 1000;
  Serial.println("");
  Serial.println(">>> If you get no display, try resetting, and removing cross talk between wires or decreasing SPI speed <<<<");
  Serial.println("");
  tft->begin(tft_spi_speed);
#ifdef ADAFRUIT_TFT
  Serial.println("SSD1331 tft begin (HWSPI broken on ESP32)");
  tft->setSPISpeed(tft_spi_speed);
  // This is very important, or FastLED_SPITFT_GFX::show will not work.
  // Size is hardcoded by TFT size.
  tft->setAddrWindow(0, 0, 96, 64);
#endif

  //============================================================================================
#else
#error "Undefined Matrix"
#endif
  //============================================================================================
  // Matrix Init End
  //============================================================================================

#ifdef HAS_TFT
  Serial.print("TFT configured, resolution: ");
  Serial.print(tftw);
  Serial.print("x");
  Serial.print(tfth);
  Serial.print(". GFX size:");
  Serial.print(mw);
  Serial.print("x");
  Serial.print(mh);
  Serial.print(". GFX Size Ratio: ");
  Serial.print(gfx_scale);
  Serial.print(". Speed: ");
  Serial.print(tft_spi_speed);
  Serial.println(" (80Mhz is fastest but sometimes unstable)");
#endif

  show_free_mem("Before matrix->begin");
  matrix->begin();
  //show_free_mem("After matrix->begin");

  Serial.print("Setting Brightness: ");
  Serial.println(matrix_brightness);
#if defined(SMARTMATRIX)
  matrixLayer.setBrightness(matrix_brightness);
#else
  matrix->setBrightness(matrix_brightness);
#endif
  Serial.print("Gamma Correction: ");
  Serial.println(matrix_gamma);
  // Gamma is used by AnimatedGIFs and others, as such:
  // CRGB color = CRGB(matrix->gamma[red], matrix->gamma[green], matrix->gamma[blue]);
  matrix->precal_gamma(matrix_gamma);

  // LEDMatrix alignment is tricky, this test helps make sure things are aligned correctly
#ifndef DISABLE_MATRIX_TEST
#ifdef LEDMATRIX
  Serial.println("LEDMatrix Test");
  ledmatrix.DrawLine (0, 0, ledmatrix.Width() - 1, ledmatrix.Height() - 1, CRGB(0, 255, 0));
  ledmatrix.DrawPixel(0, 0, CRGB(255, 0, 0));
  ledmatrix.DrawPixel(ledmatrix.Width() - 1, ledmatrix.Height() - 1, CRGB(0, 0, 255));

  ledmatrix.DrawLine (ledmatrix.Width() - 5, 4, 4, ledmatrix.Height() - 5, CRGB(128, 128, 128));
  ledmatrix.DrawPixel(ledmatrix.Width() - 5, 4,  CRGB(255, 64, 64));
  ledmatrix.DrawPixel(4, ledmatrix.Height() - 5, CRGB(64, 64, 255));
  matrix->show();
  delay(1000);
#endif
#endif

#ifndef DISABLE_SPEED_TEST
  uint32_t before;
  Serial.println("vvvvvvvvvvvvvvvvvvvvvvvvvv Speed vvvvvvvvvvvvvvvvvvvvvvvvvv");
#ifdef HAS_TFT
  before = millis();
  for (uint8_t i = 0; i < 5; i++) {
    tft->fillScreen(0);
    tft->fillScreen(0xFFFF);
  }
  Serial.print("TFT SPI Speed: ");
  Serial.print(tft_spi_speed / 1000000);
  Serial.print("Mhz (");
  Serial.print(millisdiff(before));
  Serial.print("ms) Resulting fps: ");
  Serial.println(10 * 1000 / millisdiff(before));

  before = millis();
  for (uint8_t i = 0; i < 10; i++) {
    matrix->show(0, 0);
    if (gfx_scale != 1) matrix->show(0, mh);
  }
  Serial.print("Matrix->show() Speed Test: ");
  Serial.print(millisdiff(before));
  Serial.print("ms, fps: ");
  Serial.println(10 * 1000 / (millisdiff(before)));
  // if only one show() command is run and the whole screen
  // isn't covered, adjust the scale
  //Serial.println(10*1000 / (millisdiff(before)*gfx_scale));

  before = millis();
  for (uint8_t i = 0; i < 10; i++) {
    matrix->show(0, 0, true);
    if (gfx_scale != 1) matrix->show(0, mh, true);
  }
  // this bypasses accessing PSRAM but also converting, reading, and
  // writing data in the no PSRAM case.
  Serial.print("Matrix->show() BYPASS Speed Test: ");
  Serial.print(millisdiff(before));
  Serial.print("ms, fps: ");
  Serial.println(10 * 1000 / (millisdiff(before)));
#endif // HAS_TFT
  before = millis();
  for (uint16_t i = 0; i < 5; i++) {
    matrix->fillScreen(0xFC00);
    matrix->show();
#ifdef HAS_TFT
    if (gfx_scale != 1) matrix->show(0, mh);
#endif
    matrix->fillScreen(0x003F);
    matrix->show();
#ifdef HAS_TFT
    if (gfx_scale != 1) matrix->show(0, mh);
#endif
  }
  Serial.print("Framebuffer::GFX end to end speed test: ");
  Serial.print(millisdiff(before));
  Serial.print("ms, fps: ");
  Serial.println(10 * 1000 / (millisdiff(before)));
  // Arduino::GFX ILI9314
  //                     tft/gfx/bypass/copy
  // 40fhz, fps no PSRAM: 25/15/22/14       PSRAM: 25/11/21/8
  // 80fhz, fps no PSRAM: 42/19/33/18       PSRAM: 40/14/32/9 (Arduino_HWSPI)
  // 80fhz, fps no PSRAM: 53/21/38/20 Arduino_ESP32SPI
  // 80fhz, fps no PSRAM: 60/20/34/18 Arduino_ESP32SPI_DMA
  //
  // Adafruit ILI9314 (much slower)
  // 80Mhz: TFT 40fps, NO PSRAM: 32fps, PSRAM show: 12fps
  //
  // Old Adafruit numbers:
  // ST7735_128b160: 80Mhz: TFT153fps, NO PSRAM:104fps, PSRAM show: 45fps
  // ST7735_128b160: 40Mhz: TFT 68fps, NO PSRAM: 56fps, PSRAM show: 32fps
  // ST7735_128b160: 20Mhz: TFT 53fps, NO PSRAM: 45fps, PSRAM show: 29fps
  // ST7735_128b128: 40Mhz: TFT117fps, NO PSRAM: 90fps, PSRAM show: 48fps
  //
  // Arduino::GFX is a lot faster (over 100fps)
  // SSD1331: SWSPI: TFT  9fps, NO PSRAM:  9fps, PSRAM show:  8fps
  Serial.println("^^^^^^^^^^^^^^^^^^^^^^^^^^ Speed ^^^^^^^^^^^^^^^^^^^^^^^^^^");
#endif // DISABLE_SPEED_TEST
  matrix->fillScreen(0x0000);
  matrix->show();
#ifdef HAS_TFT
  if (gfx_scale != 1) matrix->show(0, mh);
#endif


  // At least on teensy, due to some framework bug it seems, early
  // serial output gets looped back into serial input
  // Hence, flush input.
  while (Serial.available() > 0) {
    char t = Serial.read();
    t = t;
  }
  Serial.println("matrix_setup done");
}
#endif // neomatrix_config_h
// vim:sts=4:sw=4:et
